OpenNuvoton/M55M1BSP/Library/StdDriver/src/canfd.c
/** @addtogroup CANFD_EXPORTED_FUNCTIONS CAN_FD Exported Functions
  @{
*/

/** @cond HIDDEN_SYMBOLS */
/**
  * @brief      Returns module clock of specified CAN FD interface
  *
  * @param[in]  psCanfd      The pointer of CAN FD module.
  *
  * @return     Module clock of specified CAN FD interface.
  */
static uint32_t CANFD_GetSourceClock(const CANFD_T *psCanfd)
{
    uint32_t u32ClkSrc = 0;
    uint32_t u32ClkFreq = __HIRC;

    /* Get CAN FD module clock source and divider */
    if (psCanfd == (CANFD_T *)CANFD0)
    {
        u32ClkSrc = CLK_GetModuleClockSource(CANFD0_MODULE);
    }
    else if (psCanfd == (CANFD_T *)CANFD1)
    {
        u32ClkSrc = CLK_GetModuleClockSource(CANFD1_MODULE);
    }
    else
    {
        u32ClkFreq = 0UL;
    }

    if (u32ClkFreq != 0UL)
    {
        /* Get CAN FD module clock */
        if (u32ClkSrc == 0UL)
        {
            u32ClkFreq = __HXT;
        }
        else if (u32ClkSrc == 1UL)
        {
            u32ClkFreq = CLK_GetAPLL0ClockFreq() / 2UL;
        }
        else if (u32ClkSrc == 2UL)
        {
            u32ClkFreq = CLK_GetHCLK0Freq();
        }
        else if (u32ClkSrc == 3UL)
        {
            u32ClkFreq = __HIRC;
        }
        else
        {
            u32ClkFreq = __HIRC48M / 4UL;
        }
    }

    return u32ClkFreq;
}
/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief       Gets the CAN FD interface Nominal bit rate.
 *
 * @param[in]   psCanfd      The pointer of CAN FD module.
 *
 * @return      Nominal bit rate of specified CAN FD interface.
 * @details     Gets the CAN FD interface Nominal bit rate.
 */
uint32_t CANFD_GetNominalBitRate(const CANFD_T *psCanfd)
{
    uint32_t u8Tq = 0UL;
    uint32_t u8NtSeg1 = 0UL;
    uint32_t u8NtSeg2 = 0UL;
    uint32_t u32BitRate = 0UL;
    uint32_t u32CanfdClk = 0UL;
    uint32_t u32CanfdDiv = 0UL;

    u32CanfdClk = CANFD_GetSourceClock(psCanfd);

    if (psCanfd == (CANFD_T *)CANFD0)
    {
        u32CanfdDiv = ((CLK->CANFDDIV & CLK_CANFDDIV_CANFD0DIV_Msk) >> CLK_CANFDDIV_CANFD0DIV_Pos) + 1UL;
    }
    else if (psCanfd == (CANFD_T *)CANFD1)
    {
        u32CanfdDiv = ((CLK->CANFDDIV & CLK_CANFDDIV_CANFD1DIV_Msk) >> CLK_CANFDDIV_CANFD1DIV_Pos) + 1UL;
    }
    else
    {
        return 0UL;
    }

    u32CanfdClk = u32CanfdClk / u32CanfdDiv;
    u8Tq = ((psCanfd->NBTP & CANFD_NBTP_NBRP_Msk) >> CANFD_NBTP_NBRP_Pos) + 1UL;
    u8NtSeg1 = ((psCanfd->NBTP & CANFD_NBTP_NTSEG1_Msk) >> CANFD_NBTP_NTSEG1_Pos);
    u8NtSeg2 = ((psCanfd->NBTP & CANFD_NBTP_NTSEG2_Msk) >> CANFD_NBTP_NTSEG2_Pos);
    u32BitRate = (u32CanfdClk / u8Tq) / (u8NtSeg1 + u8NtSeg2 + 3UL);

    return u32BitRate;
}

/**
 * @brief       Gets the CAN FD interface Data bit rate.
 *
 * @param[in]   psCanfd      The pointer of CAN FD module.
 *
 * @return      Data bit rate of specified CAN FD interface.
 * @details     Gets the CAN FD interface Data bit rate.
 *              If CAN FD interface is in CAN mode, this function will return 0. Because data bit rate is only valid in CAN FD mode.
 */
uint32_t CANFD_GetDataBitRate(const CANFD_T *psCanfd)
{
    uint32_t u8Tq = 0UL;
    uint32_t u8NtSeg1 = 0UL;
    uint32_t u8NtSeg2 = 0UL;
    uint32_t u32BitRate = 0UL;
    uint32_t u32CanfdClk = 0UL;
    uint32_t u32CanfdDiv = 0UL;

    if ((psCanfd->CCCR & CANFD_CCCR_FDOE_Msk) == 0UL)
    {
        return 0UL;
    }

    u32CanfdClk = CANFD_GetSourceClock(psCanfd);

    if (psCanfd == (CANFD_T *)CANFD0)
    {
        u32CanfdDiv = ((CLK->CANFDDIV & CLK_CANFDDIV_CANFD0DIV_Msk) >> CLK_CANFDDIV_CANFD0DIV_Pos) + 1UL;
    }
    else if (psCanfd == (CANFD_T *)CANFD1)
    {
        u32CanfdDiv = ((CLK->CANFDDIV & CLK_CANFDDIV_CANFD1DIV_Msk) >> CLK_CANFDDIV_CANFD1DIV_Pos) + 1UL;
    }
    else
    {
        return 0UL;
    }

    u32CanfdClk = u32CanfdClk / u32CanfdDiv;
    u8Tq = ((psCanfd->DBTP & CANFD_DBTP_DBRP_Msk) >> CANFD_DBTP_DBRP_Pos) + 1UL;
    u8NtSeg1 = ((psCanfd->DBTP & CANFD_DBTP_DTSEG1_Msk) >> CANFD_DBTP_DTSEG1_Pos);
    u8NtSeg2 = ((psCanfd->DBTP & CANFD_DBTP_DTSEG2_Msk) >> CANFD_DBTP_DTSEG2_Pos);
    u32BitRate = (u32CanfdClk / u8Tq) / (u8NtSeg1 + u8NtSeg2 + 3UL);

    return u32BitRate;
}

/**
 * @brief       Calculates the CAN FD RAM buffer address.
 *
 * @param[in]   psConfigAddr  CAN FD element star address structure.
 * @param[in]   psConfigSize  CAN FD element size structure.
 *
 * @return      None.
 *
 * @details     Calculates the CAN FD RAM buffer address.
 */
static void CANFD_CalculateRamAddress(CANFD_RAM_PART_T *psConfigAddr, CANFD_ELEM_SIZE_T *psConfigSize)
{
    uint32_t u32RamAddrOffset = 0;

    /* Get the Standard Message ID Filter element address */
    if (psConfigSize->u32SIDFC > 0UL)
    {
        psConfigAddr->u32SIDFC_FLSSA = 0;
        u32RamAddrOffset += psConfigSize->u32SIDFC * sizeof(CANFD_STD_FILTER_T);
    }

    /* Get the Extend Message ID Filter element address */
    if (psConfigSize->u32XIDFC > 0UL)
    {
        psConfigAddr->u32XIDFC_FLESA = u32RamAddrOffset;
        u32RamAddrOffset += psConfigSize->u32XIDFC * sizeof(CANFD_EXT_FILTER_T);
    }

    /* Get the Tx Buffer and Tx FIFO/Queue element address */
    if ((psConfigSize->u32TxBuf + psConfigSize->u32TxFifoQueue)  > 0UL)
    {
        if ((psConfigSize->u32TxBuf + psConfigSize->u32TxFifoQueue) > 32UL)
        {
            psConfigSize->u32TxBuf = 16;
            psConfigSize->u32TxFifoQueue = 16;
        }

        psConfigAddr->u32TXBC_TBSA = u32RamAddrOffset;
        u32RamAddrOffset += (psConfigSize->u32TxBuf + psConfigSize->u32TxFifoQueue) * sizeof(CANFD_BUF_T);
    }

    /* Get the Rx Buffer element address */
    if (psConfigSize->u32RxBuf > 0UL)
    {
        psConfigAddr->u32RXBC_RBSA = u32RamAddrOffset;
        u32RamAddrOffset += psConfigSize->u32RxBuf * sizeof(CANFD_BUF_T);
    }

    /* Get the Rx FIFO0 element address */
    if (psConfigSize->u32RxFifo0 > 0UL)
    {
        psConfigAddr->u32RXF0C_F0SA = u32RamAddrOffset;
        u32RamAddrOffset += psConfigSize->u32RxFifo0 * sizeof(CANFD_BUF_T);
    }

    /* Get the Rx FIFO1 element address */
    if (psConfigSize->u32RxFifo1 > 0UL)
    {
        psConfigAddr->u32RXF1C_F1SA = u32RamAddrOffset;
        u32RamAddrOffset += psConfigSize->u32RxFifo1 * sizeof(CANFD_BUF_T);
    }

