OpenNuvoton/M55M1BSP/Library/StdDriver/src/canfd.c
    /* Get the Rx FIFO1 element address */
    if (psConfigSize->u32TxEventFifo > 0UL)
    {
        psConfigAddr->u32TXEFC_EFSA = u32RamAddrOffset;
    }
}


/**
 * @brief       Get the default configuration structure.
 *
 * @param[in]   psConfig       Pointer to CAN FD configuration structure.
 * @param[in]   u8OpMode       Setting the CAN FD Operating mode.
 *
 * @return      None.
 *
 * @details     This function initializes the CAN FD configure structure to default value.
 *              The default value are:
 *              sNormBitRate.u32BitRate   = 500000bps;
 *              u32DataBaudRate     = 0(CAN mode) or 1000000(CAN FD mode) ;
 *              u32MRamSize         = 6144 bytes (1536 words);
 *              bEnableLoopBack     = FALSE;
 *              bBitRateSwitch      = FALSE(CAN Mode) or TRUE(CAN FD Mode);
 *              bFDEn               = FALSE(CAN Mode) or TRUE(CAN FD Mode);
 *              CAN FD Standard ID elements = 30
 *              CAN FD Extended ID elements = 30
 *              CAN FD TX Buffer elements = 20
 *              CAN FD RX Buffer elements = 20
 *              CAN FD RX FIFO0 elements = 20
 *              CAN FD RX FIFO1 elements = 20
 *              CAN FD TX Event FIFO elements = 3
*/
void CANFD_GetDefaultConfig(CANFD_FD_T *psConfig, uint8_t u8OpMode)
{
    if (psConfig->sElemSize.u32UserDef == 0UL)
    {
        (void)memset(psConfig, 0, sizeof(CANFD_FD_T));
    }

    psConfig->sBtConfig.sNormBitRate.u32BitRate = 500000;

    if (u8OpMode == (uint8_t)CANFD_OP_CAN_MODE)
    {
        psConfig->sBtConfig.sDataBitRate.u32BitRate = 0;
        psConfig->sBtConfig.bFDEn = FALSE;
        psConfig->sBtConfig.bBitRateSwitch = FALSE;
    }
    else
    {
        psConfig->sBtConfig.sDataBitRate.u32BitRate = 1000000;
        psConfig->sBtConfig.bFDEn = TRUE;
        psConfig->sBtConfig.bBitRateSwitch = TRUE;
    }

    /*Disable the Internal Loopback mode */
    psConfig->sBtConfig.bEnableLoopBack = FALSE;
    /*Get the CAN FD memory size(number of byte)*/
    psConfig->u32MRamSize  = CANFD_SRAM_SIZE;

    if (psConfig->sElemSize.u32UserDef == 0UL)
    {
        /* CAN FD Standard message ID elements as 30 elements    */
        psConfig->sElemSize.u32SIDFC = 30;
        /* CAN FD Extended message ID elements as 30 elements    */
        psConfig->sElemSize.u32XIDFC = 30;
        /* CAN FD TX Buffer elements as 10 elements    */
        psConfig->sElemSize.u32TxBuf = 15;
        /* CAN FD Tx FIFO/Queue elements as 5 elements    */
        psConfig->sElemSize.u32TxFifoQueue = 5;
        /* CAN FD RX Buffer elements as 20 elements    */
        psConfig->sElemSize.u32RxBuf = 20;
        /* CAN FD RX FIFO0 elements as 20 elements    */
        psConfig->sElemSize.u32RxFifo0 = 20;
        /* CAN FD RX FIFO1 elements as 20 elements    */
        psConfig->sElemSize.u32RxFifo1 = 20;
        /* CAN FD TX Event FOFI elements as 3 elements    */
        psConfig->sElemSize.u32TxEventFifo = 3;
        /*Calculates the CAN FD RAM buffer address*/
    }

    CANFD_CalculateRamAddress(&psConfig->sMRamStartAddr, &psConfig->sElemSize);
}


/**
 * @brief       Encode the Data Length Code.
 *
 * @param[in]   u8NumberOfBytes  Number of bytes in a message.
 *
 * @return      Data Length Code.
 *
 * @details     Converts number of bytes in a message into a Data Length Code.
 */
static uint8_t CANFD_EncodeDLC(uint8_t u8NumberOfBytes)
{
    if (u8NumberOfBytes <= (uint8_t)8)
    {
        return u8NumberOfBytes;
    }
    else if (u8NumberOfBytes <= (uint8_t)12)
    {
        return 9;
    }
    else if (u8NumberOfBytes <= (uint8_t)16)
    {
        return 10;
    }
    else if (u8NumberOfBytes <= (uint8_t)20)
    {
        return 11;
    }
    else if (u8NumberOfBytes <= (uint8_t)24)
    {
        return 12;
    }
    else if (u8NumberOfBytes <= (uint8_t)32)
    {
        return 13;
    }
    else if (u8NumberOfBytes <= (uint8_t)48)
    {
        return 14;
    }
    else
    {
        return 15;
    }
}


/**
 * @brief       Decode the Data Length Code.
 *
 * @param[in]   u8Dlc   Data Length Code.
 *
 * @return      Number of bytes in a message.
 *
 * @details     Converts a Data Length Code into a number of message bytes.
 */
static uint8_t CANFD_DecodeDLC(uint8_t u8Dlc)
{
    if (u8Dlc <= (uint8_t)8)
    {
        return u8Dlc;
    }
    else if (u8Dlc == (uint8_t)9)
    {
        return 12;
    }
    else if (u8Dlc == (uint8_t)10)
    {
        return 16;
    }
    else if (u8Dlc == (uint8_t)11)
    {
        return 20;
    }
    else if (u8Dlc == (uint8_t)12)
    {
        return 24;
    }
    else if (u8Dlc == (uint8_t)13)
    {
        return 32;
    }
    else if (u8Dlc == (uint8_t)14)
    {
        return 48;
    }
    else
    {
        return 64;
    }
}


/**
 * @brief       Sets the CAN FD protocol timing characteristic.
 *
 * @param[in]   psCanfd     The pointer of the specified CANFD module.
 * @param[in]   psConfig    Pointer to the timing configuration structure.
 *
 * @return      None.
 *
 * @details     This function gives user settings to CAN bus timing characteristic.
 *              The function is for an experienced user. For less experienced users, call
 *              the CANFD_Open() and fill the baud rate field with a desired value.
 *              This provides the default timing characteristics to the module.
 */
static void CANFD_SetTimingConfig(CANFD_T *psCanfd, const CANFD_TIMEING_CONFIG_T *psConfig)
{

    /* configuration change enable */
    psCanfd->CCCR |= CANFD_CCCR_CCE_Msk;

    if (psCanfd == (CANFD_T *)CANFD0)
    {
        /* Get CANF D0 clock divider number */
        CLK->CANFDDIV = (CLK->CANFDDIV & ~CLK_CANFDDIV_CANFD0DIV_Msk) | CLK_CANFDDIV_CANFD0DIV(psConfig->u8PreDivider);
    }
    else
    {
        CLK->CANFDDIV = (CLK->CANFDDIV & ~CLK_CANFDDIV_CANFD1DIV_Msk) | CLK_CANFDDIV_CANFD1DIV(psConfig->u8PreDivider);
    }

    /* nominal bit rate */
    psCanfd->NBTP = (((psConfig->u8NominalRJumpwidth & 0x7FUL) - 1UL) << 25) +
                    (((psConfig->u16NominalPrescaler & 0x1FFUL) - 1UL) << 16) +
                    ((((psConfig->u8NominalPhaseSeg1 + psConfig->u8NominalPropSeg) & 0xFFUL) - 1UL) << 8) +
                    (((psConfig->u8NominalPhaseSeg2 & 0x7FUL) - 1UL) << 0);


    /* canfd->DBTP */
    if (psCanfd->CCCR & CANFD_CCCR_FDOE_Msk)
    {

