OpenNuvoton/M55M1BSP/Library/StdDriver/src/canfd.c
        psCanfd->DBTP = (((psConfig->u8DataPrescaler & 0x1FUL) - 1UL) << 16) +
                        ((((psConfig->u8DataPhaseSeg1 + psConfig->u8DataPropSeg) & 0x1FUL) - 1UL) << 8) +
                        (((psConfig->u8DataPhaseSeg2 & 0xFUL) - 1UL) << 4) +
                        (((psConfig->u8DataRJumpwidth & 0xFUL) - 1UL) << 0);

    }
}


/**
 * @brief       Get the segment values.
 *
 * @param[in]   u32NominalBaudRate  The nominal speed in bps.
 * @param[in]   u32DataBaudRate     The data speed in bps.
 * @param[in]   u32Ntq              Number of nominal time quanta per bit.
 * @param[in]   u32Dtq              Number of data time quanta per bit.
 * @param[in]   psConfig            Passed is a configuration structure, on return the configuration is stored in the structure
 *
 * @return      None.
 *
 * @details     Calculates the segment values for a single bit time for nominal and data baudrates.
 */
static void CANFD_GetSegments(uint32_t u32NominalBaudRate, uint32_t u32DataBaudRate, uint32_t u32Ntq, uint32_t u32Dtq, CANFD_TIMEING_CONFIG_T *psConfig)
{
    float ideal_sp;
    uint32_t u32P1;

    /* get ideal sample point */
    if (u32NominalBaudRate >= 1000000UL)
    {
        ideal_sp = 0.750;
    }
    else if (u32NominalBaudRate >= 800000UL)
    {
        ideal_sp = 0.800;
    }
    else
    {
        ideal_sp = 0.875;
    }

    /* distribute time quanta */
    u32P1 = (uint32_t)((float)u32Ntq * ideal_sp);
    /* can controller doesn't separate prop seg and phase seg 1 */
    psConfig->u8NominalPropSeg = 0;
    /* subtract one TQ for sync seg */
    psConfig->u8NominalPhaseSeg1 = u32P1 - 1UL;
    psConfig->u8NominalPhaseSeg2 = u32Ntq - u32P1;
    /* sjw is 20% of total TQ, rounded to nearest int */
    psConfig->u8NominalRJumpwidth = (u32Ntq + (4UL)) / 5UL;


    /* if using baud rate switching then distribute time quanta for data rate */
    if (u32Dtq > 0UL)
    {
        /* get ideal sample point */
        if (u32DataBaudRate >= 1000000UL)
        {
            ideal_sp = 0.750;
        }
        else if (u32DataBaudRate >= 800000UL)
        {
            ideal_sp = 0.800;
        }
        else
        {
            ideal_sp = 0.875;
        }

        /* distribute time quanta */
        u32P1 = (uint32_t)((float)u32Dtq * ideal_sp);
        /* can controller doesn't separate prop seg and phase seg 1 */
        psConfig->u8DataPropSeg = 0;
        /* subtract one TQ for sync seg */
        psConfig->u8DataPhaseSeg1 = u32P1 - 1UL;
        psConfig->u8DataPhaseSeg2 = u32Dtq - u32P1;
        /* sjw is 20% of total TQ, rounded to nearest int */
        psConfig->u8DataRJumpwidth = (u32Dtq + (4UL)) / 5UL;
    }
    else
    {
        psConfig->u8DataPropSeg = 0;
        psConfig->u8DataPhaseSeg1 = 0;
        psConfig->u8DataPhaseSeg2 = 0;
        psConfig->u8DataRJumpwidth = 0;
    }
}


/**
 * @brief       Calculates the CAN controller timing values for specific baudrates.
 *
 * @param[in]   psCanfd             Pointer to CAN FD configuration structure.
 * @param[in]   u32NominalBaudRate  The nominal speed in bps.
 * @param[in]   u32DataBaudRate     The data speed in bps. Zero to disable baudrate switching.
 * @param[in]   u32SourceClock_Hz   CAN FD Protocol Engine clock source frequency in Hz.
 * @param[in]   psConfig            Passed is a configuration structure, on return the configuration is stored in the structure
 *
 * @return      true if timing configuration found, false if failed to find configuration.
 *
 * @details     Calculates the CAN controller timing values for specific baudrates.
 */
static uint32_t CANFD_CalculateTimingValues(const CANFD_T *psCanfd, uint32_t u32NominalBaudRate, uint32_t u32DataBaudRate, uint32_t u32SourceClock_Hz, CANFD_TIMEING_CONFIG_T *psConfig)
{
    uint32_t u32Ntq;
    uint32_t u32Dtq;
    uint32_t u32NominalBaudRateTemp = u32NominalBaudRate;

    /* observe baud rate maximums */
    if (u32NominalBaudRateTemp > MAX_NOMINAL_BAUDRATE)
    {
        u32NominalBaudRateTemp = MAX_NOMINAL_BAUDRATE;
    }

    for (u32Ntq = (uint32_t)MAX_TIME_QUANTA; u32Ntq >= (uint32_t)MIN_TIME_QUANTA; u32Ntq--)
    {
        uint32_t u32Nclk = u32NominalBaudRateTemp * u32Ntq;

        for (psConfig->u16NominalPrescaler = 0x001UL; psConfig->u16NominalPrescaler <= 0x400UL; (psConfig->u16NominalPrescaler)++)
        {
            uint32_t u32Nclk2;

            u32Nclk2 = u32Nclk * psConfig->u16NominalPrescaler;

            if (((u32SourceClock_Hz / u32Nclk2) <= 256UL) && ((u32SourceClock_Hz % u32Nclk2) == 0UL))
            {
                psConfig->u8PreDivider = u32SourceClock_Hz / u32Nclk2;

                /*FD Operation enabled*/
                if (psCanfd->CCCR & CANFD_CCCR_FDOE_Msk)
                {
                    /* if not using baudrate switch then we are done */
                    if (!u32DataBaudRate)
                    {
                        u32Dtq = 0;
                        psConfig->u8DataPrescaler = 0;
                        CANFD_GetSegments(u32NominalBaudRateTemp, u32DataBaudRate, u32Ntq, u32Dtq, psConfig);
                        return TRUE;
                    }

                    /* if baudrates are the same and the solution for nominal will work for
                    data, then use the nominal settings for both */
                    if ((u32DataBaudRate == u32NominalBaudRateTemp) && (psConfig->u16NominalPrescaler <= 0x20UL))
                    {
                        u32Dtq = u32Ntq;
                        psConfig->u8DataPrescaler = (uint8_t)psConfig->u16NominalPrescaler;
                        CANFD_GetSegments(u32NominalBaudRateTemp, u32DataBaudRate, u32Ntq, u32Dtq, psConfig);
                        return TRUE;
                    }

                    /* calculate data settings */
                    for (u32Dtq = (uint32_t)MAX_TIME_QUANTA; u32Dtq >= (uint32_t)MIN_TIME_QUANTA; u32Dtq--)
                    {
                        uint32_t u32Dclk;

                        u32Dclk = u32DataBaudRate * u32Dtq;

                        for (psConfig->u8DataPrescaler = 0x01UL; psConfig->u8DataPrescaler <= 0x20UL; (psConfig->u8DataPrescaler)++)
                        {
                            uint32_t u32Dclk2;

                            u32Dclk2 = u32Dclk * psConfig->u8DataPrescaler;

                            if (u32SourceClock_Hz == ((uint32_t)u32Dclk2 * psConfig->u8PreDivider))
                            {
                                CANFD_GetSegments(u32NominalBaudRateTemp, u32DataBaudRate, u32Ntq, u32Dtq, psConfig);
                                return TRUE;
                            }
                        }
                    }
                }
                else
                {
                    CANFD_GetSegments(u32NominalBaudRateTemp, 0, u32Ntq, 0, psConfig);
                    return TRUE;
                }
            }
        }
    }

